# 邮件收发
# 场景：工作沟通邮件。登录注册；广告；修改密码、激活链接、邮件客户端。
# 参考 ？？？？
# 第三客户端登录密码验证：tuhtbcyhpxgscicc
# 另一个：
"""
准备工作：
1> 授权。各邮箱大同小异，这里以QQ邮箱为例。
2> QQ邮箱首页/设置/账号 向下翻到POP3/IMAP/SMTP服务
3> 开启 IMAP/SMTP服务
"""
"""
邮件相关协议：
- SMTP（simple mail transfer protocol）简单邮件传输协议。用于发邮件。
- POP3(Post Office Protocol) 邮局协议。将邮件服务器上资料同步到本地。用于收邮件。    开通以上两种协议后收邮件，发现可以正常收取，但有个问题，通过程序拉起的邮件已下载已阅读，但登录官方邮件后发现之前下载的邮件仍然是未读状态。说明POP3协议只能简单地收件但不能标记邮件状态。
- IMAP()，交互式邮件存取协议，POP3协议的增强版。标记已读、删除，跟官方邮件服务器状态保持同步，体验较好。
"""
"""
发邮件的包：
- smtplib poplib imaplib ,内置包 缺点不太方便
- 
"""

# 3342899060@qq.com
# mkccqigsafkodaja


